# Использование официального базового образа Java с Maven
FROM maven:3.8.4-openjdk-17-slim as builder

# Определение рабочей директории внутри образа для сборки проекта
WORKDIR /app

# Копирование файлов pom.xml и исходного кода в образ
COPY pom.xml .
COPY src ./src

# Сборка приложения, пропуская тесты для ускорения процесса
RUN mvn clean package -DskipTests

# Использование базового образа Java для запуска собранного приложения
FROM openjdk:17-slim

# Определение рабочей директории внутри контейнера
WORKDIR /app

# Копирование только собранного jar файла из предыдущего этапа сборки
COPY --from=builder /app/target/*.jar app.jar

# Открытие порта 8081 для внешнего доступа к приложению
EXPOSE 8081

# Команда для запуска приложения
CMD ["java", "-jar", "app.jar"]
